<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Carbon;
use App\Models\User;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        $roles = [
            ['name' => 'user'],
            ['name' => 'admin'],
        ];

        foreach ($roles as $role) {
            DB::table('roles')->insert($role);
        }

        $users = [
            [
                'name' => 'Zxccursed',
                'email' => 'zxczxc52@gmail.com',
                'password' => Hash::make('zxczxc123'),
                'role_id' => 2,
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
            [
                'name' => 'Admin',
                'email' => 'admin@mail.ru',
                'password' => Hash::make('adminadmin777'),
                'role_id' => 2,
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
            ],
        ];

        foreach ($users as $user) {
            DB::table('users')->insert($user);
        }

        $departaments = [
            ['name' => 'D&d', 'img' => 'D&D.webp', 'fixed_post' => 1],
            ['name' => 'Web', 'img' => 'it.jpg', 'fixed_post' => 2],
            ['name' => 'Прочее', 'img' => 'forum.png', 'fixed_post' => 3],
        ];

        foreach ($departaments as $departament) {
            DB::table('departaments')->insert($departament);
        }

        $posts = [
            [
                'title' => 'Что такое D&D?',
                'description' => 'В этом году 40-летие отмечает популярная настольная игра Dungeons & Dragons. Появившись в 1974 году как инициатива двух фанатов настолок, D&D быстро снискала популярность среди игроков. А саму игру можно найти на полках любого магазина настолок и в игровых клубах. Рассказываем про настольную игру ДНД — что это такое и как в нее играть, разбираемся в причинах ее популярности и объясняем базовые принципы игры.',
                'content' => 'Это содержимое первого поста.',
                'tags' => 'тег1, тег2',
                'user_id' => 2,
                'departament_id' => 1,
            ],
            [
                'title' => 'О чем этот раздел?',
                'description' => 'Данный раздел мы посвятили развитию нашей платформы. Тут вы смотжете оставлять статьи, которые мы рассмотрим, и, возможно, реализуем ваши идеи!',
                'content' => 'Это содержимое второго поста.',
                'tags' => 'тег3',
                'user_id' => 2,
                'departament_id' => 2,
            ],
            [
                'title' => 'Как мы к этому пришли?',
                'description' => 'Очень интересная история, как мы пришли к реализации нашей платформы. Все началось месяцев 6 назад. Сыграв партию, без какого либо графического сопровождения, мы поняли, что это не то. Мы отправились на поиски достойного графического сопровождения, но ничего не нашли) так и было принято решения об основании платформы.',
                'content' => 'Это содержимое второго поста.',
                'tags' => 'тег3',
                'user_id' => 2,
                'departament_id' => 3,
            ],
        ];
        foreach ($posts as $post) {
            DB::table('posts')->insert($post);
        }

        $sources = [
            [
                'name' => 'Кастомный',
            ],
            [
                'name' => 'Звери'
            ],
            [
                'name' => 'Люди',
            ],
            [
                'name' => 'Исчадия',
            ],
            [
                'name' => 'Драконы',
            ],
            [
                'name' => 'Растения'
            ],
            [
                'name' => 'Нежить'
            ],
            [
                'name' => 'Прочее'
            ],
            [
                'name' => 'Монстры'
            ],
            [
                'name' => 'Гумоноиды'
            ],
            [
                'name' => 'Дроу'
            ],
            [
                'name' => 'Гоблин'
            ],
            [
                'name' => 'Именные'
            ]
        ];

        foreach ($sources as $source) {
            DB::table('sources')->insert($source);
        }
        ;

        $bestiary11 = [
            [
                'name' => 'Эсканор',
                'path' => '3e95a53b1ec582c9a4148650c3a9927c.jpg',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Бармен Уил',
                'path' => '3008bd40ab7c81e8bc437e0d048b82a1 (1).jpg',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Аггрон Стонбрейк',
                'path' => '636252776953159856.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Бафамет',
                'path' => '636369569074233815.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Кас',
                'path' => '636755111672538115.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Руфина Дроу',
                'path' => '636949025832276766.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Барнибус Бластвинд',
                'path' => '636988822001719674.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Амрик Вантампур',
                'path' => '637001789234402930.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Груминк Ренегат',
                'path' => '637856462603948222.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Обми',
                'path' => '636988001985520263.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Орейот',
                'path' => '637856398691246817.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Отовир',
                'path' => '636369569074233815.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Ози',
                'path' => '638342873817284663.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Стоун',
                'path' => '638465564475393931.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Святой рис',
                'path' => '638944250138346280.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Хог Бьерн',
                'path' => '639074856151587316.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Дроу Отто',
                'path' => '637880557205601085.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
            [
                'name' => 'Сигизмунд',
                'path' => '638735984456015263.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 13
            ],
        ];

        $bestiary1 = [
            [
                'name' => 'Снежный кот',
                'path' => '636357409884630294.webp',
                'initiative' => 14,
                'description' => 'Эти кошки, размером с пантеру, внешне напоминают рысь. Окрас снежного кота варьируется от ослепительно-белого до грязно-коричневого. Эти создания терпеливые охотники, подстерегающие свою добычу затаиваясь среди скал.',
                'idInBestiary' => 1,
                'source_id' => 2
            ],
            [
                'name' => 'Лютый волк',
                'path' => '636376300477893222.webp',
                'initiative' => 14,
                'description' => 'Волки встречаются в субарктических и умеренных регионах мира, где они часто передвигаются стаями через холмы и леса.',
                'idInBestiary' => 2,
                'source_id' => 2
            ],
            [
                'name' => 'Козел',
                'path' => '637357081729925065.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 3,
                'source_id' => 2
            ],
            [
                'name' => 'Гигантский бабуин',
                'path' => '638465563118204965.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 4,
                'source_id' => 2
            ],
            [
                'name' => 'Собака',
                'path' => '638465563730812092.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 5,
                'source_id' => 2
            ],
            [
                'name' => 'Бабуин',
                'path' => '638465564343106987.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 6,
                'source_id' => 2
            ],
            [
                'name' => 'Медведь',
                'path' => '638512253691009202.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 7,
                'source_id' => 2
            ],
            [
                'name' => 'Обезбяна',
                'path' => '638607408671951647.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 8,
                'source_id' => 2
            ],
            [
                'name' => 'Черный медведь',
                'path' => '638607409966263242.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 9,
                'source_id' => 2
            ],
            [
                'name' => 'Кот',
                'path' => '638607414146520300.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 10,
                'source_id' => 2
            ],
            [
                'name' => 'Лягушка',
                'path' => '638607417426081315.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 11,
                'source_id' => 2
            ],
            [
                'name' => 'Лев',
                'path' => '638607428015267243.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 12,
                'source_id' => 2
            ],
            [
                'name' => 'Великий лев',
                'path' => 'i (1).webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 13,
                'source_id' => 2
            ],
            [
                'name' => 'Боевой пес',
                'path' => '638607428415948051.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 14,
                'source_id' => 2
            ],
            [
                'name' => 'Мул',
                'path' => '638607428703028777.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 15,
                'source_id' => 2
            ],
            [
                'name' => 'Лошадь',
                'path' => '638607431384220950.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 16,
                'source_id' => 2
            ],
            [
                'name' => 'Тигр',
                'path' => '638607434270663754.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 17,
                'source_id' => 2
            ],
            [
                'name' => 'Боевой конь',
                'path' => '638607434778564331.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 18,
                'source_id' => 2
            ],
            [
                'name' => 'Волк',
                'path' => '638607435567745183.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 19,
                'source_id' => 2
            ],
            [
                'name' => 'Орел',
                'path' => '638741964002529266.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 20,
                'source_id' => 2
            ],
            [
                'name' => 'Кобан',
                'path' => '638741964097222858.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 21,
                'source_id' => 2
            ],
            [
                'name' => 'Гиена',
                'path' => '638741964120414350.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 22,
                'source_id' => 2
            ],
            [
                'name' => 'Обезьяна альбинос',
                'path' => '638742154065775180.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 23,
                'source_id' => 2
            ],
            [
                'name' => 'Гигантский волк',
                'path' => '638742831345964759.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 24,
                'source_id' => 2
            ],
            [
                'name' => 'Крыса',
                'path' => '638742838302908263.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 25,
                'source_id' => 2
            ],
            [
                'name' => 'Ворон',
                'path' => '638742838862827460.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 26,
                'source_id' => 2
            ],
            [
                'name' => 'Грифон',
                'path' => 'griffin.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 27,
                'source_id' => 2
            ],
        ];

        $bestiary2 = [
            [
                'name' => 'Имп',
                'path' => '636252778559844878.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 28,
                'source_id' => 4
            ],
            [
                'name' => 'Демон',
                'path' => '637880557828348220.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 29,
                'source_id' => 4
            ],
            [
                'name' => 'Демон лорд',
                'path' => '638512253791316397.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 30,
                'source_id' => 4
            ],
            [
                'name' => 'Старший демон',
                'path' => '638521866148799695.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 31,
                'source_id' => 4
            ],
            [
                'name' => 'Демон рыцарь',
                'path' => '638736708829809115.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 32,
                'source_id' => 4
            ],
            [
                'name' => 'Свирепый демон',
                'path' => '638741964520361867.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 33,
                'source_id' => 4
            ],
        ];

        $bestiary3 = [
            [
                'name' => 'Дракон',
                'path' => '636238956323100804.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 34,
                'source_id' => 5
            ],
            [
                'name' => 'Драконид',
                'path' => '638741964250237108.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 35,
                'source_id' => 5
            ],
            [
                'name' => 'Морской дракон',
                'path' => '636312391009671396.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 36,
                'source_id' => 5
            ],
        ];

        $bestiary4 = [
            [
                'name' => 'Дроу убийца',
                'path' => '638894860219559828.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 37,
                'source_id' => 11
            ],
            [
                'name' => 'Лорд дроу',
                'path' => '638506035219379633.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 38,
                'source_id' => 11
            ],
            [
                'name' => 'Страж Дроу',
                'path' => '637961800689862455.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 39,
                'source_id' => 11
            ],
            [
                'name' => 'Дроу',
                'path' => '638894860308189569.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 40,
                'source_id' => 11
            ],
            [
                'name' => 'Дроу злой маг',
                'path' => '638512253926723268.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 41,
                'source_id' => 11
            ],
            [
                'name' => 'Мать Дроу',
                'path' => '637880557421240829.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 42,
                'source_id' => 11
            ],
            [
                'name' => 'Дроу Воин',
                'path' => '637880557408639679.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 43,
                'source_id' => 11
            ],
            [
                'name' => 'Дроу Маг',
                'path' => '637880557404539153.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 44,
                'source_id' => 11
            ],
            [
                'name' => 'Юный Дроу',
                'path' => '637828636850849166.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 45,
                'source_id' => 11
            ],
        ];

        $bestiary5 = [
            [
                'name' => 'Ратлинг',
                'path' => '636252735120780359.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 46,
                'source_id' => 10
            ],
            [
                'name' => 'Минотавр',
                'path' => '636252765008399409.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 47,
                'source_id' => 10
            ],
            [
                'name' => 'Служитель свежеватель разума',
                'path' => '636312287871741533.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 48,
                'source_id' => 10
            ],
            [
                'name' => 'Варлорд гнолл',
                'path' => '636330365854887826.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 49,
                'source_id' => 10
            ],
            [
                'name' => 'Гнолл воин',
                'path' => '636330370100869231.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 50,
                'source_id' => 10
            ],
            [
                'name' => 'Хоггоблин воин',
                'path' => '638741964286645034.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 51,
                'source_id' => 10
            ],
            [
                'name' => 'Хоггоблин капитан',
                'path' => '638741964280447262.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 52,
                'source_id' => 10
            ],
            [
                'name' => 'Хоггоблин полководец',
                'path' => '638741964280447262.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 53,
                'source_id' => 10
            ],
            [
                'name' => 'Свеживатель разума',
                'path' => '638291908572175160.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 54,
                'source_id' => 10
            ],
            [
                'name' => 'Хоггоблин',
                'path' => '636330487449832593.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 55,
                'source_id' => 10
            ],
            [
                'name' => 'Минотавр воин',
                'path' => '638512254106433975.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 56,
                'source_id' => 10
            ],
            [
                'name' => 'Ратлинг воин',
                'path' => '638386042677564519.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 57,
                'source_id' => 10
            ],
            [
                'name' => 'Авен',
                'path' => '638735984437196549.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 58,
                'source_id' => 10
            ],
            [
                'name' => 'Фрог',
                'path' => '638742811169784760.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 59,
                'source_id' => 10
            ],
            [
                'name' => 'Фрог маг',
                'path' => '638742810248496972.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 60,
                'source_id' => 10
            ],
            [
                'name' => 'Крысиный принц',
                'path' => '638844714173213708.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 61,
                'source_id' => 10
            ],
            [
                'name' => 'Минотавр Бахамута',
                'path' => '638741964416838756.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 62,
                'source_id' => 10
            ],
        ];

        $bestiary6 = [
            [
                'name' => 'Мимик',
                'path' => '636252764730856081.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 63,
                'source_id' => 9
            ],
            [
                'name' => 'Химера',
                'path' => '636252766769687627.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 64,
                'source_id' => 9
            ],
            [
                'name' => 'Тролль',
                'path' => '636252770534498850.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 65,
                'source_id' => 9
            ],
            [
                'name' => 'Феникс',
                'path' => '636603599873317947.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 66,
                'source_id' => 9
            ],
            [
                'name' => 'Тролль',
                'path' => '638264236356298996.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 67,
                'source_id' => 9
            ],
            [
                'name' => 'Мозговая крыса',
                'path' => '638318543595932912.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 68,
                'source_id' => 9
            ],
            [
                'name' => 'Свирепый минотавр',
                'path' => '638512254195353241.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 69,
                'source_id' => 9
            ],
            [
                'name' => 'Тролль',
                'path' => '638512254301900277.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 70,
                'source_id' => 9
            ],
            [
                'name' => 'Волчий паук',
                'path' => '638607426458975567.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 71,
                'source_id' => 9
            ],
            [
                'name' => 'Древний волк',
                'path' => '638681468012058593.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 72,
                'source_id' => 9
            ],
            [
                'name' => 'Гигантский паук',
                'path' => '638741964156568682.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 73,
                'source_id' => 9
            ],
            [
                'name' => 'Гидра',
                'path' => '638741964300550266.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 74,
                'source_id' => 9
            ],
            [
                'name' => 'Нога гигантского тролля',
                'path' => '638741964742304698.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 75,
                'source_id' => 9
            ],
            [
                'name' => 'Тролль',
                'path' => '638741964745290773.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 76,
                'source_id' => 9
            ],
            [
                'name' => 'Водный элементаль',
                'path' => '638741964803171793.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 77,
                'source_id' => 9
            ],
            [
                'name' => 'Огненный элементаль',
                'path' => '638742814891874801.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 78,
                'source_id' => 9
            ],
            [
                'name' => 'Крысинный король',
                'path' => '638844714178049165.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 79,
                'source_id' => 9
            ],
            [
                'name' => 'Скайрас',
                'path' => '638844714030605951.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 80,
                'source_id' => 9
            ],
            [
                'name' => 'Василиск',
                'path' => '638741963919336626.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 81,
                'source_id' => 9
            ],
        ];

        $bestiary7 = [
            [
                'name' => 'Волчий корень',
                'path' => '637743395568116126.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 82,
                'source_id' => 6
            ],
            [
                'name' => 'Бродяга',
                'path' => '637861450548192450.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 83,
                'source_id' => 6
            ],
            [
                'name' => 'Трент',
                'path' => '638560560722482155.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 84,
                'source_id' => 6
            ],
        ];

        $bestiary8 = [
            [
                'name' => 'Повелитель нежити',
                'path' => '636599093536392353.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 85,
                'source_id' => 7
            ],
            [
                'name' => 'Лич',
                'path' => '636755106129172572.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 86,
                'source_id' => 7
            ],
            [
                'name' => 'Рыцарь смерти',
                'path' => '638590888552365770.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 87,
                'source_id' => 7
            ],
            [
                'name' => 'Призрак',
                'path' => '638741964654823706.webp',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 88,
                'source_id' => 7
            ],
        ];

        $bestiary9 = [
            [
                'name' => 'Образ смерти',
                'path' => '3ca7c69aab8e4849617490cc8f45d2c0.jpg',
                'initiative' => 12,
                'description' => 'Козы неприхотливы, хорошо переносят как низкие, так и высокие температуры, однако плохо адаптируются к влажному климату.',
                'idInBestiary' => 89,
                'source_id' => 8
            ],
        ];

        $maps = [
            [
                'name' => 'Пристань',
                'path' => '0b47579f77760c65e29e8de00bb7628e.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Лесной склон',
                'path' => '4cbUc4BMJnMiNbXfC1oo1MJYGOrhXME-TQt69SjXFbr-8KDdS7KlwtVRc1dhP75zFaoLS6z7vqkNS7ayS18ulX7V.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Таверна',
                'path' => '6ba6ed48ea7eddbb120c6618fa398408.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Площадь',
                'path' => '8GmMCfKK1fOdSifW9IdoltAwyTJRc9ua1WDSwuAtAJxKN8G4sK4tf_47gHNLJ_NCa5GIVXBvMks-4-gHWcTJBKVA.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Горный склон',
                'path' => '1609163716170691326.webp',
                'source_id' => 2
            ],
            [
                'name' => 'Городские ворота',
                'path' => 'GlBLZ2Hs_fifPwGI7mcp3ZIFwO6FE7hQaXBK-qZP22ysqbj6TuWxgNjHAi-oPii9JExolPAwivQ0RT0pA0qtHjPt.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Побережье',
                'path' => 'GLVhtFidyecg9G0h4RGkhKPpN1CvObKKvnrLSn_1rSslBfl9TNwOOfi-RfKblhImSZdmuIS-X54FxDT5N2aqQez2.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Лесная чаща',
                'path' => 'LwoUGUa8JOi2Pq4tylar5nb_YJluOCXSuOm6EjTlxC42oWlUS8rLcy-icm5qWU9C-xo0qmuDkLVUz6f5MriSHgB1.jpg',
                'source_id' => 2
            ],
            [
                'name' => 'Побережье с кораблем',
                'path' => 'vA9hIVogWpiZeR3QyS0hQmboUjLvtHZVBt0Di0hREpmvpcuA0uFLPc2XcbXux71ERjWzeGyrn0u9w6VhRqtXwX8i.jpg',
                'source_id' => 2
            ],
        ];
        $objects = [
            [
                'name' => 'Коробка с гоблинами',
                'path' => 'object1.png',
                'source_id' => 6
            ]
        ];


        foreach ($objects as $object) {
            DB::table('objects')->insert($object);
        }
        ;
        foreach ($bestiary1 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary2 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary3 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary4 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary5 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary6 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary7 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary8 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($bestiary9 as $entity) {
            DB::table('entities')->insert($entity);
        }
        ;
        foreach ($maps as $map) {
            DB::table('maps')->insert($map);
        }
        ;
    }
}